app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(school_class_params)
    if @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "class 1"], ["room_number", 1], ["created_at", "2019-05-01 08:47:14.089708"], ["updated_at", "2019-05-01 08:47:14.089708"]]

  def update
    if @school_class.update_attributes(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "year 2"], ["room_number", 5], ["updated_at", "2019-05-01 09:21:00.454344"], ["id", 1]]

  def find_school_class
    @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]