app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "sadsa"], ["last_name", "sadgfd"], ["created_at", "2019-04-30 19:59:44.328435"], ["updated_at", "2019-04-30 19:59:44.328435"]]

  def update
    if @student.update_attributes(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "ayush"], ["last_name", "gehlot"], ["updated_at", "2019-05-01 11:21:58.274030"], ["id", 1]]